src/theory/y_combinator.org
#+TITLE: Y组合子
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil 

在这篇文章里，我会尝试推导出Y组合子，这是函数递归理论最重要的成果之一

* Y组合子
  在某些情况下可以不用给函数取名字，下面代码就是用匿名函数实现了“6加1”：
  #+BEGIN_SRC scheme
  ((lambda (x)
     (+ x 1))
   6) ;; => 7
  #+END_SRC

  可不可以用匿名函数来表达递归过程呢？比如：
  #+BEGIN_SRC scheme
  (define fact
    (lambda (n)
      (if (zero? n)
	  1
	  (* n (fact (- n 1))))))
  #+END_SRC
  在最后一行的使用了 _fact_ 这个函数名字来产生递归调用，看起来好像无法用匿名函数来实现递归。实际上这个观点是错误的，后面一步一步地改造fact函数，来推导出整个过程

** 把fact作为参数传递

   #+BEGIN_SRC scheme
  (define op-maker
    (lambda (op)
      (lambda (x)
	(op x))))
   #+END_SRC

   使用类似上面的模板代码把最后一行的 _fact_ 作为参数传递进去：

   #+BEGIN_SRC scheme
    (define fact-maker
      (lambda (procedure)
	(lambda (n)
	  (if (zero? n)
	      1
	      (* (procedure (- n 1)) n)))))  

  ;;  fact-maker ; =>  #<procedure:fact-maker>

  ;; ((fact-maker fact-maker) 5)  
  ; *: contract violation
  ;   expected: number?
  ;   given: #<procedure>
  ;   argument position: 1st
   #+END_SRC 

   上面代码不工作，因为 _fact-maker_ 返回值是一个 *匿名函数* ，而  _(* (fact-maker (- n 1)) n)_ 要求 _(fact-maker (- n 1))_ 是一个数字

   用下面的代码来修复这个问题：

   #+BEGIN_SRC scheme
  (define fact-maker
      (lambda (procedure)
	(lambda (n)
	   (if (zero? n)
	       1
	       (* n ((procedure procedure) (- n 1)))))))

  ((fact-maker fact-maker) 5) ; => 120
   #+END_SRC

   至今为止，我们成功地把函数名从过程体里面去掉了，但是我们在调用的时候还是要把函数名 _fact-maker_ 传入

** 去除函数名
   ((fact-maker fact-maker) 5) 等价于 (fact 5), 因此可以重新定义fact函数为：
   #+BEGIN_SRC scheme 
  (define fact 
    ((lambda (procedure)
       (lambda (n)
	 (if (zero? n)
	     1
	     (* n ((procedure procedure) (- n 1)))))) ; fact-maker
     (lambda (procedure)
       (lambda (n)
	 (if (zero? n)
	     1
	     (* n ((procedure procedure) (- n 1)))))) ; fact-maker
     ))

  (fact 5) ; => 120
   #+END_SRC 

   实际上可以完全不定义fact的名字，直接调用：
   #+BEGIN_SRC scheme
  (
   ((lambda (procedure)
     (lambda (n)
       (if (zero? n)
	   1
	   (* n ((procedure procedure) (- n 1)))))) ; fact-maker
   (lambda (procedure)
     (lambda (n)
       (if (zero? n)
	   1
	   (* n ((procedure procedure) (- n 1)))))) ; fact-maker
  ) 5) ; => 120
   #+END_SRC

   这一大堆东西已经可以实现不定义函数名来完成递归调用了。接下来要把和fact函数相关的逻辑抽象出来，推广到通用过程中

