html/theory/y_combinator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Y组合子</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">Y组合子</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6532201">Y组合子</a>
<ul>
<li><a href="#orge08ad0b">把fact作为参数传递</a></li>
<li><a href="#org3fd41bd">去除函数名</a></li>
<li><a href="#org6224c02">分离业务逻辑</a>
<ul>
<li><a href="#orga4a192a">代入步骤2的结果</a></li>
<li><a href="#org71ddc46">替换fact逻辑</a></li>
</ul>
</li>
<li><a href="#orga3d3448">把F*作为参数传入</a></li>
<li><a href="#org7cbab11">抽取重复的lambda定义</a></li>
</ul>
</li>
<li><a href="#orgd624083">意义</a></li>
</ul>
</div>
</div>
<p>
在这篇文章里，我会尝试推导出Y组合子，这是函数递归理论最重要的成果之一
</p>

<div id="outline-container-org6532201" class="outline-2">
<h2 id="org6532201">Y组合子</h2>
<div class="outline-text-2" id="text-org6532201">
<p>
在某些情况下可以不用给函数取名字，下面代码就是用匿名函数实现了“6加1”：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span>+ x 1<span style="color: #696969;">))</span>
 6<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 7</span>
</pre>
</div>

<p>
可不可以用匿名函数来表达递归过程呢？比如：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fact</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
        1
        <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>fact <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span>
</pre>
</div>
<p>
在最后一行的使用了 <span class="underline">fact</span> 这个函数名字来产生递归调用，看起来好像无法用匿名函数来实现递归。实际上这个观点是错误的，后面一步一步地改造fact函数，来推导出整个过程
</p>
</div>

<div id="outline-container-orge08ad0b" class="outline-3">
<h3 id="orge08ad0b">把fact作为参数传递</h3>
<div class="outline-text-3" id="text-orge08ad0b">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">op-maker</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>op<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>op x<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
使用类似上面的模板代码把最后一行的 <span class="underline">fact</span> 作为参数传递进去：
</p>

<div class="org-src-container">
<pre class="src src-scheme">  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fact-maker</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
            1
            <span style="color: #696969;">(</span>* <span style="color: #696969;">(</span>procedure <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))</span> n<span style="color: #696969;">)))))</span>  

<span style="color: #5f9ea0; font-style: italic;">;;  </span><span style="color: #5f9ea0; font-style: italic;">fact-maker ; =&gt;  #&lt;procedure:fact-maker&gt;</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">((fact-maker fact-maker) 5)  </span>
<span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">*: contract violation</span>
<span style="color: #5f9ea0; font-style: italic;">;   </span><span style="color: #5f9ea0; font-style: italic;">expected: number?</span>
<span style="color: #5f9ea0; font-style: italic;">;   </span><span style="color: #5f9ea0; font-style: italic;">given: #&lt;procedure&gt;</span>
<span style="color: #5f9ea0; font-style: italic;">;   </span><span style="color: #5f9ea0; font-style: italic;">argument position: 1st</span>
</pre>
</div>

<p>
上面代码不工作，因为 <span class="underline">fact-maker</span> 返回值是一个 <b>匿名函数</b> ，而  <span class="underline">(* (fact-maker (- n 1)) n)</span> 要求 <span class="underline">(fact-maker (- n 1))</span> 是一个数字
</p>

<p>
用下面的代码来修复这个问题：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fact-maker</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
             1
             <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">)))))))</span>

<span style="color: #696969;">((</span>fact-maker fact-maker<span style="color: #696969;">)</span> 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 120</span>
</pre>
</div>

<p>
至今为止，我们成功地把函数名从过程体里面去掉了，但是我们在调用的时候还是要把函数名 <span class="underline">fact-maker</span> 传入
</p>
</div>
</div>

<div id="outline-container-org3fd41bd" class="outline-3">
<h3 id="org3fd41bd">去除函数名</h3>
<div class="outline-text-3" id="text-org3fd41bd">
<p>
((fact-maker fact-maker) 5) 等价于 (fact 5), 因此可以重新定义fact函数为：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fact</span> 
  <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
           1
           <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fact-maker</span>
   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
           1
           <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fact-maker</span>
   <span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>fact 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 120</span>
</pre>
</div>

<p>
实际上可以完全不定义fact的名字，直接调用：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>
 <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
         1
         <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fact-maker</span>
 <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
         1
         <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">fact-maker</span>
<span style="color: #696969;">)</span> 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 120</span>
</pre>
</div>

<p>
这一大堆东西已经可以实现不定义函数名来完成递归调用了。接下来要把和fact函数相关的逻辑抽象出来，推广到通用过程中
</p>
</div>
</div>
