src/theory/y_combinator.org
** 分离业务逻辑
   首先，把计算阶乘的逻辑分离出来作为一个参数，这样一来其他的计算逻辑，可以作为通过这个参数传递进去

   #+BEGIN_SRC scheme
  (define F
    (lambda (n)
	 (if (zero? n)
	     1
	     (* n ((procedure procedure) (- n 1)))))) 
   #+END_SRC

   这并不难完全满足需求，还需要继续变换。我们知道 (h arg) 等价于 ( (lambda (x) (h x)) arg)，由此可以把 ((procedure procedure) (- n 1)) 替换成： 
   #+BEGIN_SRC scheme 
  ((lambda (arg) ((procedure procedure) arg)) (- n 1)) 
   #+END_SRC

   把这个替换带 _F_ 函数中：
   #+BEGIN_SRC scheme
    (define F
      (lambda (n)
	(if (zero? n)
	    1
	    (* n ((lambda (arg) ((procedure procedure) arg)) (- n 1))))))
   #+END_SRC

   接着把 _((lambda (arg) ((procedure procedure) arg)) (- n 1))_ 抽象成一个参数：
   #+BEGIN_SRC scheme
    (define F
      ((lambda (func-arg)
	 (lambda (n)
	   (if (zero? n)
	       1
	       (* n (func-arg (- n 1))))))
       (lambda (arg) ((procedure procedure) arg))))
   #+END_SRC

   开始F的定义是：
   #+BEGIN_EXAMPLE
     (define F (lambda (n) ... < procedure >))
   #+END_EXAMPLE

   现在F的定义是：
   #+BEGIN_EXAMPLE
     (define F ((lambda (func-arg) (lambda (n) ...)) < procedure >))
   #+END_EXAMPLE

   而<procedure>的定义是：

   #+BEGIN_EXAMPLE
     (lambda (arg) ((procedure procedure ) ...) ...) 
   #+END_EXAMPLE

*** 代入步骤2的结果
    现在把刚才的结果代入到步骤2的结果中：
    #+BEGIN_SRC scheme
  (define fact
    ((lambda (procedure)
       ((lambda (func-arg)
	 (lambda (n)
	    (if (zero? n)
		1
		(* n (func-arg (- n 1))))))
	(lambda (arg) ((procedure procedure) arg))))
     (lambda (procedure)
       ((lambda (func-arg)
	 (lambda (n)
	    (if (zero? n)
		1
		(* n (func-arg (- n 1))))))
	(lambda (arg) ((procedure procedure) arg))))))

  (fact 5) ; => 120 
    #+END_SRC

    注意 *((lambda (func-arg)...* 之前的两个括号：
    #+BEGIN_EXAMPLE
    ......
    ((lambda (func-arg) < body-using-func-arg >) (lambda (arg) ...)) 
    #+END_EXAMPLE
    计算结果和下面是一样的： 
    #+BEGIN_EXAMPLE
      ((lambda (arg) ((procedure procedure) arg)) (- n 1))
    #+END_EXAMPLE
    两者的区别是： *第一种形式参数是一个函数，而第二种形式的参数一个数字* 

*** 替换fact逻辑 
    仔细研究下面的代码：
    #+BEGIN_SRC scheme
  (lambda (func-arg)
    (lambda (n)
      (if (zero? n)
	  1
	  (* n (func-arg (- n 1))))))
    #+END_SRC
    _(lambda (func-arg) ...)_ 这段代码包含了计算阶乘的所有逻辑，如果把它定义成 _F*_：
    #+BEGIN_SRC scheme
  (define F*
    (lambda (func-arg)
	   (lambda (n)
	      (if (zero? n)
		  1
		  (* n (func-arg (- n 1)))))))

  (define fact
      ((lambda (procedure)
	 (F* (lambda (arg) ((procedure procedure) arg))))
       (lambda (procedure)
	 (F* (lambda (arg) ((procedure procedure) arg))))))
    #+END_SRC

    我们可以用 *任何的其他业务逻辑* 作为 _F*_ 来替换 _计算阶乘的特定逻辑_ 。唯一留下的问题在于：还需要在外面定义F*

