html/theory/y_combinator.html

<div id="outline-container-org6224c02" class="outline-3">
<h3 id="org6224c02">分离业务逻辑</h3>
<div class="outline-text-3" id="text-org6224c02">
<p>
首先，把计算阶乘的逻辑分离出来作为一个参数，这样一来其他的计算逻辑，可以作为通过这个参数传递进去
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">F</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
           1
           <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span> 
</pre>
</div>

<p>
这并不难完全满足需求，还需要继续变换。我们知道 (h arg) 等价于 ( (lambda (x) (h x)) arg)，由此可以把 ((procedure procedure) (- n 1)) 替换成： 
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))</span> 
</pre>
</div>

<p>
把这个替换带 <span class="underline">F</span> 函数中：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">F</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
        1
        <span style="color: #696969;">(</span>* n <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))</span> <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span>
</pre>
</div>

<p>
接着把 <span class="underline">((lambda (arg) ((procedure procedure) arg)) (- n 1))</span> 抽象成一个参数：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">F</span>
  <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>func-arg<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
           1
           <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>func-arg <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span>
   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
开始F的定义是：
</p>
<pre class="example">
(define F (lambda (n) ... &lt; procedure &gt;))
</pre>

<p>
现在F的定义是：
</p>
<pre class="example">
(define F ((lambda (func-arg) (lambda (n) ...)) &lt; procedure &gt;))
</pre>

<p>
而&lt;procedure&gt;的定义是：
</p>

<pre class="example">
(lambda (arg) ((procedure procedure ) ...) ...) 
</pre>
</div>

<div id="outline-container-orga4a192a" class="outline-4">
<h4 id="orga4a192a">代入步骤2的结果</h4>
<div class="outline-text-4" id="text-orga4a192a">
<p>
现在把刚才的结果代入到步骤2的结果中：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fact</span>
  <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
     <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>func-arg<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
              1
              <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>func-arg <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))))</span>
   <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
     <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>func-arg<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
              1
              <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>func-arg <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))))))</span>

<span style="color: #696969;">(</span>fact 5<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 120 </span>
</pre>
</div>

<p>
注意 <b>((lambda (func-arg)&#x2026;</b> 之前的两个括号：
</p>
<pre class="example">
......
((lambda (func-arg) &lt; body-using-func-arg &gt;) (lambda (arg) ...)) 
</pre>
<p>
计算结果和下面是一样的： 
</p>
<pre class="example">
((lambda (arg) ((procedure procedure) arg)) (- n 1))
</pre>
<p>
两者的区别是： <b>第一种形式参数是一个函数，而第二种形式的参数一个数字</b> 
</p>
</div>
</div>

<div id="outline-container-org71ddc46" class="outline-4">
<h4 id="org71ddc46">替换fact逻辑</h4>
<div class="outline-text-4" id="text-org71ddc46">
<p>
仔细研究下面的代码：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>func-arg<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
        1
        <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>func-arg <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">))))))</span>
</pre>
</div>
<p>
<span class="underline">(lambda (func-arg) &#x2026;)</span> 这段代码包含了计算阶乘的所有逻辑，如果把它定义成 _F*_：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">F*</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>func-arg<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>n<span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>zero? n<span style="color: #696969;">)</span>
                1
                <span style="color: #696969;">(</span>* n <span style="color: #696969;">(</span>func-arg <span style="color: #696969;">(</span>- n 1<span style="color: #696969;">)))))))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fact</span>
    <span style="color: #696969;">((</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span>F* <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))))</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>procedure<span style="color: #696969;">)</span>
       <span style="color: #696969;">(</span>F* <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>arg<span style="color: #696969;">)</span> <span style="color: #696969;">((</span>procedure procedure<span style="color: #696969;">)</span> arg<span style="color: #696969;">))))))</span>
</pre>
</div>

<p>
我们可以用 <b>任何的其他业务逻辑</b> 作为 <span class="underline">F*</span> 来替换 <span class="underline">计算阶乘的特定逻辑</span> 。唯一留下的问题在于：还需要在外面定义F*
</p>
</div>
</div>
</div>
